---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.RemoveHiddenLinesByElement
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.RemoveHiddenLinesByElement

Removes hidden lines for model elements and detail elements that are obscured by other elements in the active view only.